In [1]:
import numpy as np
import pandas as pd
from pandasql import sqldf
import sqlite3

## 1 Read data

In [37]:
names = ["age", "workclass","fnlwgt","education","education-num","marital-status","occupation","relationship","race","sex","capital-gain","capital-loss","hours-per-week","native-country","salary"]
data = pd.read_csv("adult.data",sep=",",names=names)
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

## 1. Create Engine

In [13]:
from sqlalchemy import create_engine
engine = create_engine('sqlite://')

## put data to sql

In [14]:
data.to_sql('Adult', con=engine)

## 2 . Write two basic update queries

In [15]:
sql = 'UPDATE Adult set AGE = 50 where race="white" '
with engine.begin() as conn:
    conn.execute(sql)
    
engine.execute('select * from Adult limit 2').fetchall()

[(0, 39, ' State-gov', 77516, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 2174, 0, 40, ' United-States', ' <=50K'),
 (1, 50, ' Self-emp-not-inc', 83311, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K')]

In [16]:
sql = 'UPDATE Adult set fnlwgt = 80000 where age > 35'
with engine.begin() as conn:
    conn.execute(sql)
    
engine.execute('select * from Adult limit 2').fetchall()

[(0, 39, ' State-gov', 80000, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 2174, 0, 40, ' United-States', ' <=50K'),
 (1, 50, ' Self-emp-not-inc', 80000, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K')]

## delete

In [17]:
sql = 'DELETE from  Adult where age > 50'
with engine.begin() as conn:
    conn.execute(sql)
    
engine.execute('select * from Adult limit 2').fetchall()

[(0, 39, ' State-gov', 80000, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 2174, 0, 40, ' United-States', ' <=50K'),
 (1, 50, ' Self-emp-not-inc', 80000, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K')]

In [18]:
sql = "DELETE from  Adult where race = ' Black'"
with engine.begin() as conn:
    conn.execute(sql)
    
engine.execute('select * from Adult limit 2').fetchall()

[(0, 39, ' State-gov', 80000, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 2174, 0, 40, ' United-States', ' <=50K'),
 (1, 50, ' Self-emp-not-inc', 80000, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K')]

## filter

In [33]:
sql = "SELECT *  from  Adult where race = ' White' limit 2"
with engine.begin() as conn:
     row = conn.execute(sql)
     for i in row:
        print(i)

(0, 39, ' State-gov', 80000, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 2174, 0, 40, ' United-States', ' <=50K')
(1, 50, ' Self-emp-not-inc', 80000, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K')

In [34]:
sql = "SELECT *  from  Adult where age>30 limit 2"
with engine.begin() as conn:
     row = conn.execute(sql)
     for i in row:
        print(i)

(0, 39, ' State-gov', 80000, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 2174, 0, 40, ' United-States', ' <=50K')
(1, 50, ' Self-emp-not-inc', 80000, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K')

## 5. Write two function queries

In [48]:
engine.execute('select count(*) from Adult limit 2').fetchall()

[(23513,)]

In [54]:
engine.execute('select max(age), min(age) from Adult limit 2').fetchall()

[(50, 17)]